{
  "meta": {
    "name": "Mu (Henry) Ha",
    "role": "Data Scientist / MLOps",
    "location": "Surrey, BC (Vancouver Metro)",
    "email": "m8ha@uwaterloo.ca",
    "linkedin": "https://www.linkedin.com/in/mu-henry-ha",
    "github": "https://github.com/henryha2019"
  },
  "home": {
    "headline": "Data Scientist specializing in MLOps",
    "about": [
      "I am a Data Scientist with a strong MLOps and cloud foundation, focused on building production-ready machine learning systems rather than standalone models.",
      "My work spans the full ML lifecycle: data ingestion, feature engineering, model development, deployment, monitoring, and iteration. I recently led the development of an industrial predictive-maintenance system, combining interpretable ML models with a real-time monitoring dashboard to support operational decision-making in manufacturing environments.",
      "I am particularly interested in the reliability and scalability of ML systems. My recent training and hands-on work emphasize Docker, Kubernetes, Linux, GitHub Actions, Terraform (Infrastructure as Code), and AWS, enabling reproducible pipelines, automated deployments, and maintainable cloud infrastructure.",
      "With a background that bridges mechanical engineering and data science, I bring a systems-level mindset to ML problems—grounding models in physical intuition, operational constraints, and real-world impact. I aim to build ML products that are not only accurate, but deployable, observable, and trusted by end users."
    ],
    "badges": [
      "AWS Cloud Practitioner",
      "CFA Level I",
      "Dean's Honours List"
    ]
  },  
  "education": [
    {
      "institution": "University of British Columbia",
      "degree": "Master of Data Science",
      "dates": "Sep 2024 - Jul 2025",
      "location": "Vancouver, Canada",
      "highlights": [
        "Graduate training in applied machine learning, MLOps, and data-driven decision making.",
        "Strong emphasis on end-to-end ML systems, reproducibility, and production readiness."
      ]
    },
    {
      "institution": "University of Waterloo",
      "degree": "B.Sc. in Mechanical Engineering",
      "dates": "Sep 2018 - Apr 2024",
      "location": "Waterloo, Canada",
      "highlights": [
        "Artificial Intelligence Option and Management Science Option.",
        "Strong foundation in systems engineering, controls, and applied mathematics.",
        "Dean’s Honours List."
      ]
    }
  ],
  "skills": {
    "core": [
      "Python",
      "SQL",
      "Pandas",
      "NumPy",
      "scikit-learn",
      "PyTorch",
      "Statistics",
      "Experimentation"
    ],
    "mlops": [
      "Docker",
      "Kubernetes",
      "Linux",
      "GitHub Actions",
      "Terraform (IaC)",
      "AWS (EC2/S3/IAM)",
      "Model Monitoring",
      "Reproducible Pipelines"
    ],
    "tools": [
      "Git",
      "PostgreSQL",
      "FastAPI",
      "Dash/Plotly",
      "CI/CD",
      "Data Visualization",
      "Feature Engineering"
    ]
  },
  "resumes": [
    {
      "title": "Data Science Resume",
      "tagline": "DS-focused version (projects, modeling, analytics).",
      "image": "assets/img/projects/ds.gif",
      "file": "assets/docs/resume-ds.pdf",
      "tags": ["Data Science", "ML", "Dash", "SQL"],
      "bullets": [
        "Highlights ML project outcomes (predictive maintenance, segmentation, forecasting).",
        "Emphasizes modeling + evaluation and practical delivery."
      ]
    },
    {
      "title": "MLOps / Cloud Resume",
      "tagline": "Cloud + production delivery (AWS + automation + reliability).",
      "image": "assets/img/projects/mlops.gif",
      "file": "assets/docs/resume-mlops.pdf",
      "tags": ["MLOps", "AWS", "CI/CD", "Terraform"],
      "bullets": [
        "Operational focus: Docker, Kubernetes, Linux, GitHub Actions, Terraform.",
        "Positions projects as production-grade systems (deployment, monitoring, reproducibility)."
      ]
    },
    {
      "title": "Mechanical Engineering Resume",
      "tagline": "ME-focused version (design, manufacturing, GD&T).",
      "image": "assets/img/projects/me.gif",
      "file": "assets/docs/resume-me.pdf",
      "tags": ["SolidWorks", "NX", "DFM/DFA", "GD&T"],
      "bullets": [
        "Mechanical design + manufacturing experience with full-cycle engineering.",
        "Strong foundation bridging physical systems with data/automation."
      ]
    }
  ],
  "work": [
    {
      "company": "Brilliant Automation (UBC MDS Capstone)",
      "title": "Data Scientist / Mechanical Systems Engineer",
      "dates": "Apr 2025 – Jun 2025",
      "subtitle": "Predictive maintenance and automation for industrial equipment.",
      "highlights": [
        "Developed an end-to-end predictive maintenance system to monitor the health of industrial machines using sensor data.",
        "Built and trained machine learning models (Ridge, Random Forest, LSTM) to forecast potential failures, balancing accuracy with interpretability for operational use.",
        "Designed feature engineering and time-series modeling workflows to support health scoring and failure prediction.",
        "Created an interactive dashboard using Dash to visualize real-time machine health scores, historical trends, and maintenance alerts for operations teams.",
        "Applied systems engineering principles and lean manufacturing concepts to streamline data workflows and improve system reliability."
      ]
    },
    {
      "company": "Resolution Life US",
      "title": "AWS Cloud Engineer / Cloud Architect",
      "dates": "Sep 2021 – Apr 2022",
      "subtitle": "Cloud infrastructure automation and operational efficiency.",
      "highlights": [
        "Delivered a standardized EC2 \"golden image\" with preinstalled essential applications, streamlining server deployment and improving provisioning efficiency by approximately 80%.",
        "Automated the generation of monthly dashboards to visualize AWS usage and costs, improving operational visibility and decision-making.",
        "Worked closely with infrastructure and operations teams to standardize cloud environments and improve reliability across AWS deployments."
      ]
    },
    {
      "company": "University of Waterloo",
      "title": "Data Scientist Research Assistant",
      "dates": "Jan 2021 – Apr 2021",
      "subtitle": "Computer vision research for satellite-based ice concentration analysis.",
      "highlights": [
        "Applied U-Net architectures to satellite imagery to predict ice concentration and classify land, ice, and water regions.",
        "Achieved a validation loss and MSE of 0.026 on regression tasks and approximately 0.90 validation accuracy for classification.",
        "Evaluated multiple regression methods and model structures to identify and implement the most effective approaches.",
        "Demonstrated the application of deep learning techniques to real-world remote sensing data."
      ]
    },
    {
      "company": "The Weir Group",
      "title": "Manufacturing Engineer",
      "dates": "Sep 2019 – Apr 2020",
      "subtitle": "Production cost estimation, testing, and process optimization.",
      "highlights": [
        "Computed production costs for 10+ products and created Bills of Materials (BOMs) and routings in SAP to support manufacturing and supply chain planning.",
        "Conducted mechanical testing and quality control activities, including gasket compression tests, deformation analysis, and root cause analysis for design deviations.",
        "Re-engineered and optimized the cost-estimation spreadsheet, improving calculation efficiency by approximately 30–40%.",
        "Ensured compliance with safety standards and manufacturing best practices while supporting production operations."
      ]
    },
    {
      "company": "The Weir Group",
      "title": "Design Engineer",
      "dates": "Jan 2019 – Apr 2019",
      "subtitle": "Mechanical design and engineering documentation for industrial systems.",
      "highlights": [
        "Designed and modeled a circular manifold for a chemical plant and retrofitted multiple spool systems for client projects.",
        "Generated over 100 professional 3D models and 2D engineering drawings using Siemens NX and SolidWorks, including GD&T annotations.",
        "Worked in a fast-paced environment, producing 30+ detailed drawings per day to meet project deadlines.",
        "Coordinated with production and fabrication teams to support design-for-manufacturing (DFM) and design-for-assembly (DFA).",
        "Performed design verification tasks including material selection, seal geometry review, and basic stress checks to ensure compliance with client and industry requirements."
      ]
    }
  ],
  "projects": [
    {
      "title": "Production-Grade MLOps System for Stock Price Forecasting",
      "tagline": "Registry-driven ML deployment with AutoML and transformer-based models on AWS.",
      "image": "assets/img/projects/ts.gif",
      "cardLink": "https://github.com/henryha2019/stock-price-predictor",
      "links": [
      ],
      "bullets": [
        "Built a production-ready MLOps system enabling reliable training, promotion, and serving of time-series forecasting models across local and AWS environments.",
        "Integrated multiple model families—including classical baselines, AutoML (FLAML), and transformer-based models from Hugging Face—under a single MLflow registry and serving interface.",
        "Implemented registry-backed model promotion with explicit aliasing (‘@prod’) to decouple experimentation from production inference.",
        "Deployed a containerized FastAPI inference service on AWS ECS behind an Application Load Balancer, validated through live end-to-end prediction requests."
      ],
      "tools": [
        "Python",
        "MLflow",
        "FastAPI",
        "Docker",
        "AWS (ECS, ALB, S3, EC2)",
        "Terraform",
        "GitHub Actions",
        "Hugging Face Transformers",
        "AutoML (FLAML)"
      ],
      "summary": "Designed and deployed a production-grade MLOps system for time-series forecasting that supports multiple modeling approaches, including AutoML and transformer-based models from Hugging Face. The project emphasizes operational correctness through registry-driven model promotion, reproducible training, and live cloud inference on AWS, demonstrating end-to-end ownership from experimentation to production serving."
    },
    {
      "title": "Time Series Forecasting for TSLA Stock Prices",
      "tagline": "Applied deep learning for attention-based financial time-series forecasting.",
      "image": "assets/img/projects/ts.gif",
      "cardLink": "https://github.com/henryha2019/stock-price-predictor",
      "links": [],
      "bullets": [
        "Built an attention-based time-series forecasting model to learn temporal patterns in real-world equity price data.",
        "Demonstrated the practical use of sequence models for noisy, non-stationary financial time series.",
        "Evaluated forecasting quality using multiple regression metrics to assess stability and generalization."
      ],
      "tools": ["Python", "Deep Learning", "Time Series", "Temporal Fusion Transformer"],
      "summary": "Applied an attention-based deep learning model to forecast Tesla (TSLA) stock prices, focusing on learning temporal dependencies in noisy financial time series. The project emphasizes practical modeling considerations, evaluation rigor, and the strengths and limitations of deep sequence models in real-world forecasting tasks."
    },
    {
      "title": "Machine Health Prediction & Monitoring Dashboard",
      "tagline": "Predictive maintenance system for industrial equipment using interpretable ML.",
      "image": "assets/img/projects/Dashboard.gif",
      "cardLink": "https://github.com/henryha2019/capstone",
      "links": [
        { "label": "Slides", "url": "https://docs.google.com/presentation/d/1tsvjiBXDVXvVI7k3FpqnnCrjo5kDpW_P/edit?usp=sharing&ouid=117258495728912110739&rtpof=true&sd=true"}
      ],
      "bullets": [
        "Developed an end-to-end predictive maintenance system using real-world industrial sensor data.",
        "Built and evaluated multiple machine learning models (Ridge, Random Forest, LSTM), balancing accuracy with interpretability for operational use.",
        "Performed feature engineering and time-series modeling to forecast equipment health and potential failures.",
        "Designed and implemented an interactive Dash dashboard to visualize real-time health scores, historical trends, and maintenance alerts.",
        "Structured the system with deployment-readiness, reproducibility, and monitoring in mind."
      ],
      "tools": ["Python", "AWS", "Pandas", "scikit-learn", "Dash", "Time Series", "MLOps"],
      "summary": "End-to-end predictive maintenance system built on real-world industrial sensor data, combining interpretable machine learning, time-series feature engineering, and deployment-ready workflows. The project delivers real-time equipment health scoring, failure forecasting, and operational visibility through an interactive Dash dashboard, with a strong emphasis on reproducibility and monitoring."
    },
    {
      "title": "AI Wall Painting Robot – Wall Segmentation",
      "tagline": "Deep learning-based wall surface segmentation for robotic painting automation.",
      "image": "assets/img/projects/wall.png",
      "cardLink": "https://colab.research.google.com/drive/1XS9LrNXd79Az8MSTh7UCIxch-4vpfc6e?usp=sharing",
      "bullets": [
        "Implemented a Pyramid Scene Parsing Network (PSPNet) for industrial wall segmentation.",
        "Designed an encoder–decoder architecture with a PPM-based decoder for pixel-wise classification.",
        "Evaluated multiple training strategies including transfer learning and end-to-end training.",
        "Achieved 92.13% accuracy and 72.58% IoU, enabling reliable automated wall-surface detection.",
        "Preprocessed data by flattening irregular wall segments, resizing images, and applying data augmentation."
      ],
      "tools": ["PyTorch", "PSPNet", "Computer Vision", "CNN", "Robotics"],
      "summary": "Deep learning–based wall surface segmentation system for robotic painting automation, using a PSPNet encoder–decoder architecture with pyramid pooling. The model achieves high accuracy and IoU through careful data preprocessing, augmentation, and training strategy evaluation, enabling reliable pixel-level wall detection in industrial environments."
    },
    {
      "title": "ML Guard (In Progress)",
      "tagline": "Lightweight MLOps monitoring and cloud cost guard for small ML teams.",
      "image": "assets/img/projects/guard.gif",
      "cardLink": "",
      "links": [
        { "label": "GitHub (WIP)", "url": "https://github.com/your-handle/ml-guard" }
      ],
      "bullets": [
        "Designing a minimal MLOps service to monitor model health, data drift, inference latency, and cloud costs.",
        "Focused on production signals such as feature statistics, prediction distributions, and operational alerts.",
        "Integrating AWS Cost Explorer to attribute cloud spend at the model or service level.",
        "Built with a deliberate MVP scope to avoid over-engineering while preserving production realism."
      ],
      "tools": ["FastAPI", "AWS", "MLOps", "Monitoring", "Cost Optimization"],
      "summary": "Lightweight MLOps monitoring and cloud cost guard designed for small ML teams, focused on production-critical signals such as data drift, prediction distributions, inference latency, and cost attribution. Built with a deliberate MVP scope to balance operational realism with minimal infrastructure overhead."
    },
    {
      "title": "JobAI - AI Job Application Assistant (In Progress)",
      "tagline": "Backend-first AI system for resume parsing and automated job application workflows.",
      "image": "assets/img/projects/jobai.gif",
      "cardLink": "",
      "links": [
        { "label": "GitHub (WIP)", "url": "https://github.com/your-handle/jobai" }
      ],
      "bullets": [
        "Developing a FastAPI-based backend for structured resume and profile parsing.",
        "Designing APIs to support automated job application workflows and downstream integrations.",
        "Emphasizing clean interfaces, extensibility, and production-ready architecture.",
        "Positioned for future features such as credit systems, automation pipelines, and scalable deployment."
      ],
      "tools": ["LLM Integration", "REST APIs", "Pydantic", "Backend Architecture", "PostgreSQL"],
      "summary": "JobAI is a FastAPI-based backend focused on structured resume parsing and automated job application workflows, designed with clean APIs, extensibility, and production readiness in mind. The system is built to support future automation pipelines, credit-based features, and scalable deployment."
    }
  ]
}